app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Tue, 28 Jan 2014 06:06:42 UTC +00:00], ["description", "fffff"], ["name", "fff"], ["updated_at", Tue, 28 Jan 2014 06:06:42 UTC +00:00]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "users"."id" = 3  [["avatar_file_name", "3.jpg"], ["avatar_file_size", 21131], ["avatar_updated_at", Tue, 28 Jan 2014 06:59:22 UTC +00:00], ["updated_at", Tue, 28 Jan 2014 06:59:23 UTC +00:00]]